`wineventlog_system` EventCode=7045 ServiceName IN ("SecurityCenterIBM", "WinCheckDRVs")
| stats count min(_time) as firstTime max(_time) as lastTime by Computer EventCode ServiceName StartType ServiceType
| rename Computer as dest
| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
| `clop_ransomware_known_service_name_filter`
