index=something
| tstats `security_content_summariesonly` min(_time) as firstTime max(_time) as lastTime count latest(Filesystem.user) as user values(Filesystem.file_path) as file_path from datamodel=Endpoint.Filesystem by Filesystem.file_name Filesystem.dest _time span=1h
| `drop_dm_object_name(Filesystem)`
| rex field=file_name "(?<file_extension>\.[^\.]+)$"
| rex field=file_path "(?<true_file_path>([^\\\]*\\\)*).*"
| stats min(firstTime) as firstTime max(lastTime) as lastTime latest(user) as user dc(true_file_path) as path_count dc(file_name) as file_count latest(file_name) as file_name latest(true_file_path) as file_path by dest file_extension
| `security_content_ctime(lastTime)`
| `security_content_ctime(firstTime)`
| `ransomware_extensions`
| where path_count > 1 OR file_count > 20
| `common_ransomware_extensions_filter`
