`cloudwatchlogs_vpcflow` action=blocked (src_ip=10.0.0.0/8 OR src_ip=172.16.0.0/12 OR src_ip=192.168.0.0/16) ( dest_ip!=10.0.0.0/8 AND dest_ip!=172.16.0.0/12 AND dest_ip!=192.168.0.0/16)  [search  `cloudwatchlogs_vpcflow` action=blocked (src_ip=10.0.0.0/8 OR src_ip=172.16.0.0/12 OR src_ip=192.168.0.0/16) ( dest_ip!=10.0.0.0/8 AND dest_ip!=172.16.0.0/12 AND dest_ip!=192.168.0.0/16)
| stats count as numberOfBlockedConnections by src_ip
| inputlookup baseline_blocked_outbound_connections append=t
| fields - latestCount
| stats values(*) as * by src_ip
| rename numberOfBlockedConnections as latestCount
| eval newAvgBlockedConnections=avgBlockedConnections + (latestCount-avgBlockedConnections)/720
| eval newStdevBlockedConnections=sqrt(((pow(stdevBlockedConnections, 2)*719 + (latestCount-newAvgBlockedConnections)*(latestCount-avgBlockedConnections))/720))
| eval avgBlockedConnections=coalesce(newAvgBlockedConnections, avgBlockedConnections), stdevBlockedConnections=coalesce(newStdevBlockedConnections, stdevBlockedConnections), numDataPoints=if(isnull(latestCount), numDataPoints, numDataPoints+1)
| table src_ip, latestCount, numDataPoints, avgBlockedConnections, stdevBlockedConnections
| outputlookup baseline_blocked_outbound_connections
| eval dataPointThreshold = 5, deviationThreshold = 3
| eval isSpike=if((latestCount > avgBlockedConnections+deviationThreshold*stdevBlockedConnections) AND numDataPoints > dataPointThreshold, 1, 0)
| where isSpike=1
| table src_ip]
| stats values(dest_ip) as dest_ip, values(interface_id) as "resourceId" count as numberOfBlockedConnections, dc(dest_ip) as uniqueDestConnections by src_ip
| `detect_spike_in_blocked_outbound_traffic_from_your_aws_filter`
