`sysmon` EventID=20
| stats count min(_time) as firstTime max(_time) as lastTime by Computer User Destination
| rename Computer as dest
| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
| `detect_wmi_event_subscription_persistence_filter`
