index=something
| tstats `security_content_summariesonly` count from datamodel=Network_Sessions where nodename=All_Sessions.DHCP All_Sessions.tag=dhcp by All_Sessions.dest_ip All_Sessions.dest_mac
| dedup All_Sessions.dest_mac| `drop_dm_object_name("Network_Sessions")`|`drop_dm_object_name("All_Sessions")`
| search NOT [| inputlookup asset_lookup_by_str
|rename mac as dest_mac
| fields + dest_mac]
| `detect_unauthorized_assets_by_mac_address_filter`
