index=something
| tstats `security_content_summariesonly` count from datamodel=Network_Resolution where DNS.query_type IN (SIG,KEY) by DNS.flow_id
| rename DNS.flow_id as flow_id
| append [| tstats  `security_content_summariesonly` count from datamodel=Network_Traffic where All_Traffic.bytes_in>65000 by All_Traffic.flow_id
| rename All_Traffic.flow_id as flow_id]
| `detect_windows_dns_sigred_via_zeek_filter`
| stats count by flow_id
| where count>1
| fields - count
