`sysmon` EventCode IN ("23","26") TargetFilename = "*\\ProgramData\\Microsoft\\Windows Defender\\*"
| stats count, values(TargetFilename) as deleted_files, min(_time) as firstTime, max(_time) as lastTime by user, dest, signature, signature_id, Image, process_name, process_guid
| rename Image as process
| where count >=50
| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
| `excessive_file_deletion_in_windefender_folder_filter`
