`netbackup` MESSAGE="Disk/Partition backup completed successfully."
| stats latest(_time) as latestTime by COMPUTERNAME
| `security_content_ctime(latestTime)`
| rename COMPUTERNAME as dest
| eval isOutlier=if(latestTime <= relative_time(now(), "-7d@d"), 1, 0)
| search isOutlier=1
| table latestTime, dest
| `extended_period_without_successful_netbackup_backups_filter`
