index=something
| tstats `security_content_summariesonly` count from datamodel=Network_Traffic where All_Traffic.dest_port=3389 by All_Traffic.src
| `drop_dm_object_name("All_Traffic")`
| sort - count
