index=something
| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel="Endpoint.Processes" by Processes.parent_process_name Processes.process_name Processes.process Processes.user Processes.dest
| `drop_dm_object_name(Processes)`
| where len(process) > 200
| `potentially_malicious_code_on_cmdline_tokenize_score`
| apply unusual_commandline_detection
| eval score='predicted(unusual_cmdline_logits)', process=orig_process
| fields - unusual_cmdline* predicted(unusual_cmdline_logits) orig_process
| where score > 0.5
| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
| `potentially_malicious_code_on_commandline_filter`
