index=something
| tstats earliest(_time) as firstTimeSeen, latest(_time) as lastTimeSeen from datamodel=Change where (All_Changes.action=started OR All_Changes.action=created) All_Changes.status=success by All_Changes.src
| `drop_dm_object_name("All_Changes")`
| iplocation src
| where isnotnull(Country)
| table src, firstTimeSeen, lastTimeSeen, City, Country, Region
| inputlookup previously_seen_cloud_provisioning_activity_sources append=t
| stats min(firstTimeSeen) as firstTimeSeen, max(lastTimeSeen) as lastTimeSeen by src, City, Country, Region
| where lastTimeSeen > relative_time(now(), `previously_seen_cloud_provisioning_activity_forget_window`)
| eventstats min(firstTimeSeen) as globalFirstTime
| eval enough_data = if(globalFirstTime <= relative_time(now(), "-7d@d"), 1, 0)
| table src, City, Country, Region, firstTimeSeen, lastTimeSeen, enough_data
| outputlookup previously_seen_cloud_provisioning_activity_sources
