index=something
| tstats earliest(_time) as firstTimeSeen, latest(_time) as lastTimeSeen from datamodel=Change where All_Changes.action=created AND All_Changes.object_category=instance by All_Changes.user
| `drop_dm_object_name("All_Changes")`
| outputlookup previously_seen_cloud_compute_creations_by_user
| stats count
