index=something
| tstats `security_content_summariesonly` values(All_Changes.result_id) as result_id count min(_time) as firstTime max(_time) as lastTime from datamodel=Change where All_Changes.result_id=4720 OR All_Changes.result_id=4726 by _time span=4h All_Changes.user All_Changes.dest
| `security_content_ctime(lastTime)`
| `security_content_ctime(firstTime)`
| `drop_dm_object_name("All_Changes")`
| search result_id = 4720 result_id=4726
| transaction user connected=false maxspan=240m
| table firstTime lastTime count user dest result_id
| `short_lived_windows_accounts_filter`
