`wineventlog_security` EventCode=4663
| stats count by _time object_file_path object_file_name dest process_name process_path process_id EventCode
| lookup browser_app_list browser_object_path as object_file_path OUTPUT browser_process_name isAllowed
| stats count min(_time) as firstTime max(_time) as lastTime values(object_file_name) values(object_file_path)  values(browser_process_name) as browser_process_name by dest process_name process_path process_id EventCode isAllowed
| rex field=process_name "(?<extracted_process_name>[^\\\\]+)$"
| eval isMalicious=if(match(browser_process_name, extracted_process_name), "0", "1")
| where isMalicious=1 and isAllowed="false"
| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
| `windows_credential_access_from_browser_password_store_filter`
