`wineventlog_system` EventCode=7040  EventData_Xml="*disabled*"
| stats count min(_time) as firstTime max(_time) as lastTime by Computer EventCode Name UserID service ServiceName
| rename Computer as dest
| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
| `windows_event_for_service_disabled_filter`
