`ms_defender` EventCode IN (1122, 1125, 1126, 1132, 1134)
| stats count min(_time) as firstTime max(_time) as lastTime by host, Process_Name, Target_Commandline, Path, ID, EventCode
| lookup asr_rules ID OUTPUT ASR_Rule
| fillnull value=NULL
| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`| rename host as dest
| `windows_defender_asr_audit_events_filter`
